# specs_list.py
# Список спецификаций в нужном порядке: (docx_path, module_code)

SPECS = [
    ("КОР-01.00.000 Система связи модели DVS-21 Спецификация.docx", "КОР-01.00.000"),
    ("КОР-01.10.000 Кросс-плата. Спецификация.docx", "КОР-01.10.000"),
    ("КОР-01.20.000 Кросс-плата. Спецификация.docx", "КОР-01.20.000"),
    ("КОР-01.30.000 Кросс-плата. Спецификация.docx", "КОР-01.30.000"),
    ("КОР-01.31.000 Плата вспомогательная Спецификация.docx", "КОР-01.31.000"),
    ("КОР-01.40.000 Кросс-плата. Спецификация.docx", "КОР-01.40.000"),
    ("КОР-02.10.000 Модуль_преобразователя_DC_DC_SV01_Спецификация.docx", "КОР-02.10.000"),
    ("КОР-02.15.000 Модуль_сигнализации_на_24_линии_24LI_Спецификация.docx", "КОР-02.15.000"),
    ("КОР-02.20.000 Модуль_центрального_процессора_CPU1_Спецификация.docx", "КОР-02.20.000"),
    ("КОР-02.30.000_Модуль_цифровых_интерфейсов_4NSA_Спецификация.docx", "КОР-02.30.000"),
    ("КОР-02.40.000 Модуль_преобразователя_DC_DC_SV01_N_Спецификация.docx", "КОР-02.40.000"),
    ("КОР-02.50.000 Модуль_речевой_памяти_Спецификация.docx", "КОР-02.50.000"),
    ("КОР-02.60.000 Модуль_цифровых_интерфейсов_4DAV_Спецификация.docx", "КОР-02.60.000"),
    ("КОР-02.70.000 Модуль_НЧ_интерфейсов_4NPA_Спецификация.docx", "КОР-02.70.000"),
    ("КОР-02.80.000 Модуль_контроля_шлейфов_4LSL_Спецификация.docx", "КОР-02.80.000"),
    ("КОР-02.90.000 Модуль_генератора_тона_TG01_Спецификация.docx", "КОР-02.90.000"),
    ("КОР-03.11.000 Кросс_модуль_4FTR_Спецификация.docx", "КОР-03.11.000"),
    ("КОР-03.12.000 Модуль BusCPU. Спецификация.docx", "КОР-03.12.000"),
    ("КОР-03.13.000 Модуль связи Е1 Спецификация.docx", "КОР-03.13.000"),
    ("КОР-04.00.000 Пульт диспетчерский DTA-030 (спецификация).docx", "КОР-04.00.000"),
    ("КОР-04.10.000 Плата управления DTA-G Спецификация.docx", "КОР-04.10.000"),
    ("КОР-04.20.000 Плата кнопочная ТА-30Т-Т Спецификация.docx", "КОР-04.20.000"),
    ("КОР-05.00.000 Переговорное устройство WPS-04-25 Спецификация.docx", "КОР-05.00.000"),
    ("КОР-05.10.000 Плата управления WPS-04 Спецификация.docx", "КОР-05.10.000"),
    ("КОР-05.20.000 Плата усилителя. Спецификация.docx", "КОР-05.20.000"),
    # добавляй дальше... 


    # ...
]
